rheoTool/tutorials/rheoEFoam/channelEDF/PTT/DebyeHuckel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       11770;
    }
    symmetry
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          30;
        startFace       11970;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       12000;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          30;
        startFace       12200;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          12000;
        startFace       12230;
    }
)

// ************************************************************************* //
