rheoTool/tutorials/rheoEFoam/channelEDF/PTT/DebyeHuckel/0/tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volSymmTensorField;
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    inlet
    {
	type            zeroGradient;     
    }
    
    walls
    {
        type            linearExtrapolation;
	value           uniform (0 0 0 0 0 0);        
    }
    
    symmetry
    {
	type            symmetryPlane;       
    }

    outlet
    {
	type            zeroGradient;      
    }

    frontAndBack
    {
	type            empty;     
    }

}

// ************************************************************************* //
